7zip
a52dec
aalib
abseil-cpp
accounts-qml-module
accountsservice
acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
aha
akonadi-mime
alacritty
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
aom
appmenu-gtk-module
appstream
appstream-qt
appstream-qt5
archlinux-keyring
aribb24
at-spi2-core
atkmm
attica
attica5
attr
audacious
audacious-plugins
audacity
audex
audio-convert
audiocd-kio
audit
aurorae
autoconf
automake
avahi
ayatana-ido
baloo
baloo-widgets
base
base-devel
bash
bchunk
binutils
bison
blas
bluez-libs
boost-libs
breeze
breeze-icons
breeze5
breezy
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
capnproto
cblas
ccid
cdparanoia
cdrdao
cdrtools
chromaprint
cifs-utils
clang
clinfo
cmatrix
compiler-rt
composefs
confuse
convertlit
cool-retro-term
coreutils
cpio
cryptsetup
cups
cups-filters
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dconf
ddcutil
ddrescue
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
dmidecode
dolphin
dosfstools
dotnet-host
dotnet-runtime
double-conversion
duktape
dvd+rw-tools
e2fsprogs
eartag
ebook-tools
editorconfig-core-c
efibootmgr
efivar
egl-gbm
egl-wayland
egl-x11
eglexternalplatform
elfutils
enca
enchant
exfatprogs
exiv2
expat
faac
faad2
fakeroot
ffmpeg
ffmpeg4.4
ffmpegthumbs
fftw
file
filesystem
findutils
firewalld
flac
flatpak
flatpak-builder
flex
fluidsynth
fmt
fontconfig
foomatic-db-engine
foomatic-db-nonfree
foomatic-db-nonfree-ppds
foomatic-db-ppds
frameworkintegration
frameworkintegration5
freeglut
freetype2
frei0r-plugins
fribidi
fuse-common
fuse2
fuse3
gamemode
gawk
gc
gcc
gcc-libs
gcr-4
gd
gdbm
gdk-pixbuf2
geoclue
gettext
ghostscript
giflib
git
glib-networking
glib2
glibc
glibmm
glmark2
glslang
glu
gmp
gnulib-l10n
gnumeric
gnupg
gnutls
go
gobject-introspection-runtime
goffice
gparted
gperftools
gpgme
gpgmepp
gpm
gptfdisk
graphene
graphite
graphviz
grep
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gssdp
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtest
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm3
gts
guile
gupnp
gupnp-igd
gvfs
gzip
handbrake
harfbuzz
harfbuzz-icu
hdparm
hex
hicolor-icon-theme
hidapi
highway
hunspell
hwdata
hwloc
hyphen
i2c-tools
iana-etc
icoutils
icu
id3lib
ifuse
ijs
imagemagick
imath
imlib2
iproute2
iptables
iputils
iso-codes
jack2
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jre17-openjdk
json-c
json-glib
k3b
kaccounts-integration
kactivitymanagerd
karchive
karchive5
kauth
kauth5
kbd
kbookmarks
kbookmarks5
kcalendarcore
kcmutils
kcmutils5
kcodecs
kcodecs5
kcolorscheme
kcompletion
kcompletion5
kconfig
kconfig5
kconfigwidgets
kconfigwidgets5
kcontacts
kcoreaddons
kcoreaddons5
kcrash
kcrash5
kdbusaddons
kdbusaddons5
kde-cli-tools
kdeclarative
kdeclarative5
kdecoration
kded
kded5
kdesu
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kglobalaccel
kglobalaccel5
kglobalacceld
kguiaddons
kguiaddons5
kholidays
ki18n
ki18n5
kiconthemes
kiconthemes5
kid3
kid3-common
kidentitymanagement
kidletime
kinfocenter
kio
kio-extras
kio-fuse
kio5
kirigami
kirigami-addons
kirigami2
kitemmodels
kitemviews
kitemviews5
kjobwidgets
kjobwidgets5
kleopatra
kmailtransport
kmbox
kmenuedit
kmime
kmod
knewstuff
knewstuff5
knotifications
knotifications5
knotifyconfig
konsole
kpackage
kpackage5
kparts
kparts5
kpimtextedit
kpipewire
kpmcore
kpty
kquickcharts
krb5
krunner
kscreen
kscreenlocker
kservice
kservice5
ksmtp
kstatusnotifieritem
ksvg
ksystemstats
ktextaddons
ktexteditor
ktextwidgets
ktextwidgets5
kunitconversion
kuserfeedback
kwallet
kwallet5
kwayland
kwayland-integration
kwayland5
kwidgetsaddons
kwidgetsaddons5
kwin
kwindowsystem
kwindowsystem5
kxmlgui
kxmlgui5
l-smash
ladspa
lame
lapack
lasem
layer-shell-qt
lcms2
ldb
leancrypto
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gamemode
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libaccounts-glib
libaccounts-qt
libadwaita
libaio
libakonadi
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libavtp
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libburn
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libconfig
libcue
libcups
libcupsfilters
libcurl-gnutls
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdeflate
libdiscid
libdispatch
libdisplay-info
libdmtx
libdovi
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libebml
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfdk-aac
libffi
libfishsound
libfontenc
libfreeaptx
libftdi
libgcrypt
libgexiv2
libgirepository
libglvnd
libgme
libgpg-error
libgphoto2
libgsf
libgudev
libheif
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libjpeg-turbo
libjuice
libjxl
libkcddb
libkcompactdisc
libkexiv2
libkgapi
libkleo
libksba
libkscreen
libksysguard
liblc3
libldac
libldap
liblo
liblqr
liblrdf
libltc
libmad
libmalcontent
libmanette
libmatroska
libmbim
libmd
libmediainfo
libmfx
libmicrodns
libmm-glib
libmms
libmng
libmnl
libmodplug
libmp4v2
libmpc
libmpcdec
libmpeg2
libmspack
libmtp
libmusicbrainz5
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnvme
libogg
liboggz
libopenmpt
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplasma
libplist
libpng
libppd
libproxy
libpsl
libpulse
libqaccessibilityclient-qt6
libqalculate
libqmi
libqrtr-glib
libraqm
libraw1394
librsvg
libsamplerate
libsasl
libsbsms
libseccomp
libsecret
libshout
libsidplayfp
libsigc++
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent
libunibreak
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvlc
libvorbis
libvpl
libvpx
libwacom
libwbclient
libwebp
libwireplumber
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxnvctrl
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzen
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-qlogic
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
linux-headers
lirc
llvm
llvm-libs
lm_sensors
lmdb
lsb-release
lsof
lua
luajit
lv2
lvm2
lz4
lzo
m4
mailcap
make
man-db
materia-kde
mbedtls
md4c
mdadm
media-player-info
mediainfo-gui
mesa
mesa-utils
milou
mimetreeparser
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mlt
mobile-broadband-provider-info
modemmanager
modemmanager-qt
movit
mpdecimal
mpfr
mpg123
mplayer
mpv
mtdev
mtools
mujs
nano
ncurses
neon
netpbm
nettle
networkmanager
networkmanager-qt
nftables
nmap
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
nvidia
nvidia-settings
nvidia-utils
nvme-cli
nvtop
obs-studio
ocean-sound-theme
ocl-icd
oculante
okteta
onetbb
openal
opencore-amr
opencv
openexr
openh264
openjpeg2
openssh
openssl
openssl-1.1
opus
opusfile
orc
os-prober
ostree
otf-junicode
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
papirus-icon-theme
parted
partitionmanager
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-alien-build
perl-alien-libxml2
perl-capture-tiny
perl-clone
perl-dbi
perl-encode-locale
perl-error
perl-ffi-checklib
perl-file-chdir
perl-file-listing
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-image-exiftool
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-path-tiny
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-libxml
perl-xml-namespacesupport
perl-xml-sax
perl-xml-sax-base
phonon-qt6
phonon-qt6-vlc
pinentry
pipewire
pipewire-audio
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
plasma-activities
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-integration
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-workspace
plasma5-integration
plasma5support
polkit
polkit-kde-agent
polkit-qt5
polkit-qt6
poppler
poppler-data
poppler-qt6
popt
portaudio
portmidi
portsmf
power-profiles-daemon
powerdevil
ppp
pqiv
print-manager
prison
procps-ng
protobuf
psmisc
pulseaudio-qt
purpose
pv
pwgen
python
python-arrow
python-attrs
python-autocommand
python-babel
python-cairo
python-capng
python-certifi
python-charset-normalizer
python-colour
python-configobj
python-dateutil
python-dbus
python-discid
python-docopt
python-dulwich
python-easygui
python-fastbencode
python-gobject
python-gphoto2
python-idna
python-importlib-metadata
python-inflect
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-magic
python-merge3
python-more-itertools
python-musicbrainzngs
python-mutagen
python-packaging
python-patiencediff
python-pillow
python-platformdirs
python-psutil
python-pyacoustid
python-pycdio
python-pycups
python-pymediainfo
python-pyqt5
python-pyqt5-sip
python-pytz
python-pyxdg
python-pyzmq
python-requests
python-ruamel-yaml
python-ruamel.yaml.clib
python-setuptools
python-show-in-file-manager
python-six
python-sortedcontainers
python-tenacity
python-tornado
python-typeguard
python-types-python-dateutil
python-typing_extensions
python-urllib3
python-wheel
python-yaml
python-zipp
qca-qt5
qca-qt6
qcoro
qgpgme
qmltermwidget
qpdf
qqc2-breeze-style
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-imageformats
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-x11extras
qt6-5compat
qt6-base
qt6-charts
qt6-declarative
qt6-imageformats
qt6-location
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-multimedia-gstreamer
qt6-positioning
qt6-sensors
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
qt6-webchannel
qt6-webengine
qt6-websockets
qtkeychain-qt6
ranger
rapid-photo-downloader
raptor
rav1e
re2
readline
recode
ripgrep
ripgrep-all
rnnoise
rpmextract
rsync
rtkit
rtmpdump
rtorrent
rubberband
sbc
sddm
sddm-kcm
sdl2-compat
sdl3
sed
semver
sequoia-sqv
serd
shaderc
shadow
shared-mime-info
shotcut
signal-desktop
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
simdjson
slang
smartmontools
smbclient
smplayer
snappy
solid
solid5
sonic-visualiser
sonnet
sonnet5
sord
sound-theme-freedesktop
soundtouch
sox
spandsp
spectacle
speex
speexdsp
spirv-tools
spotify-launcher
sqlite
sratom
srt
startup-notification
steam
sudo
suil
svt-av1
svt-hevc
syndication
syndication5
syntax-highlighting
sysstat
system-config-printer
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tcl
tdb
telegram-desktop
tevent
texinfo
thin-provisioning-tools
tinysparql
tinyxml2
tk
tpm2-tss
tslib
ttf-fira-code
ttf-hack
ttf-ibm-plex
ttf-liberation
twolame
tzdata
uchardet
udisks2
ueberzug
unzip
upower
usbmuxd
usbutils
uthash
util-linux
util-linux-libs
v4l-utils
vamp-plugin-sdk
vapoursynth
veracrypt
verdict
vid.stab
vim
vim-runtime
vlc
vmaf
volume_key
vulkan-icd-loader
vulkan-tools
wavpack
wayland
wayland-protocols
wayland-utils
webkit2gtk
webp-pixbuf-loader
webrtc-audio-processing-1
wget
which
whipper
wildmidi
wireplumber
woff2
wpa_supplicant
wxwidgets-common
wxwidgets-gtk3
x264
x265
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfsprogs
xkeyboard-config
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xkbcomp
xorg-xmessage
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yt-dlp
zbar
zenity
zeromq
zimg
zip
zix
zlib
zlib-ng
zstd
zvbi
zxing-cpp
